app/views/static_pages/_destacados.html.erb


                 <%= image_tag dest.product_images.first.image.url(:square) , class: 'img-responsive', caption: 'articulo'  %>
---
SELECT  `products`.* FROM `products` INNER JOIN `articles` ON `articles`.`product_id` = `products`.`id` ORDER BY `products`.`created_at` DESC LIMIT 18