app/views/tiendas/_form.html.erb

SELECT `contactypes`.* FROM `contactypes`
---
  <%= f.fields_for :contacts do |contacto| %>
    <%= contacto.select :contactype_id, Contactype.all.collect {|p| [ p.name, p.id ] } %>