app/views/tiendas/index.html.erb

          <td  align="center">  <%= tienda.created_at.strftime("%d/%m/%Y ")  %></td>
          <td  align="center">  <%= tienda.articles.count %></td>
---
SELECT COUNT(*) FROM `articles` WHERE `articles`.`tienda_id` = 1