app/views/tiendas/show.html.erb


            <% @tienda.articles.each do |articulo| %>
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`tienda_id` = 1