app/views/layouts/menus/_usermenu.html.erb

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
---

    <% if current_user.profile.present? && current_user.profile.canadminstore %>