app/views/sellers/index.html.erb

SELECT `sellers`.* FROM `sellers`
---
      <tr class="active"><td>NOMBRE</td><td align="center">TOTAL ARTICULOS</td><td></td></tr>
      <% Seller.all.each do |seller| %>