app/views/sellers/show.html.erb

<%= @seller.name %>
<% if @seller.tiendas.present? %>
---
SELECT `tiendas`.* FROM `tiendas` WHERE `tiendas`.`seller_id` = 1