app/views/articles/_form.html.erb

SELECT `products`.* FROM `products`
---

  <%= f.select :product_id,  Product.all.collect {|p| [ p.name, p.id ] } %>