app/views/marcas/index.html.erb

SELECT `marcas`.* FROM `marcas`
---
<ul>
<% Marca.all.each do |marca| %>