app/controllers/articles_controller.rb

  def new
    p "Agregando articulo"
    @article = Article.new
    @tienda = Tienda.find(params[:id])
---
SELECT  `tiendas`.* FROM `tiendas` WHERE `tiendas`.`id` = 1 LIMIT 1

  def create

    @article = Article.create(art_params)
    @tienda = Tienda.find(@article.tienda_id)
---
INSERT INTO `articles` (`price`, `product_id`, `created_at`, `updated_at`, `tienda_id`, `stock`) VALUES (15000.0, 1, '2016-08-29 17:00:17', '2016-08-29 17:00:17', 1, 10)
SELECT  `tiendas`.* FROM `tiendas` WHERE `tiendas`.`id` = 1 LIMIT 1