app/controllers/categories_controller.rb

  def index
    @categories = Category.all.order(:name)
---
SELECT `categories`.* FROM `categories` WHERE (category_id is null) ORDER BY `categories`.`name` ASC

  def new
    @category = Category.new
    @raiz = Category.where("category_id is null")
---
SELECT `categories`.* FROM `categories` WHERE (category_id is null)

  def create

    p category_params[:category_id].to_s.length
    if category_params[:category_id].to_s.length > 0
      p "Creando subcategoria"
      category = Subcategory.new(category_params)

    else
      p "Creando categoria"
      category = Category.new(category_params)

    end



    if category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('VESTUARIO', '2016-08-29 16:57:59', '2016-08-29 16:57:59')
INSERT INTO `subcategories` (`name`, `category_id`, `created_at`, `updated_at`) VALUES ('BEBES', 1, '2016-08-29 16:58:07', '2016-08-29 16:58:07')