app/controllers/imagenesarticulos_controller.rb

SELECT `imagenesarticulos`.* FROM `imagenesarticulos`
---
  def index
    @imagenes = Imagenesarticulo.all

INSERT INTO `imagenesarticulos` (`created_at`, `updated_at`, `product_id`, `image_uid`, `image_name`) VALUES ('2016-08-29 16:59:55', '2016-08-29 16:59:55', 1, '2016/08/29/27ybnqrtj6_Selecci_n_015.png', 'Selección_015.png')
---
  def create

    p "Creando el articulo"
    @imagen = Imagenesarticulo.new(imagen_params)
    p imagen_params
    if @imagen.save