app/controllers/marcas_controller.rb

INSERT INTO `marcas` (`name`, `created_at`, `updated_at`) VALUES ('OUZOM', '2016-08-29 16:58:41', '2016-08-29 16:58:41')
---
  def create
    @marca = Marca.create(marca_params)