app/controllers/products_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT  `tiendas`.* FROM `tiendas` WHERE `tiendas`.`id` = 1 LIMIT 1
---
  def show
    p params
  @product = Product.find(params[:id])
    @comment = Comment.new
    @imagenesproducto = {:vacio => ""}
    @imagenes = @product.imagenes
     p @imagenes
    @imagenes.each do |imagen|
      @imagenesproducto[imagen.id] =imagen.imagen.url(:medium)
    end
    if params[:idtienda].present?
      gon.tiendaprecargada = Tienda.find(params[:idtienda])

INSERT INTO `products` (`name`, `created_at`, `updated_at`, `marca_id`, `specifications`, `year`, `subcategory_id`) VALUES ('ROPITA', '2016-08-29 16:59:34', '2016-08-29 16:59:34', 1, '<p>ROPA DE PRUEBA</p>\r\n', 2016, 1)
---
  def create


    #recupero variable subcategoria que se seteo por angular

    product_params[:subcategory_id] = params[:subcategory_id]
    p "ID subcategoria", params[:subcategory_id]
    p params
    @producto = Product.new(product_params)
    @producto.subcategory_id = params[:subcategory_id]

    if @producto.save