app/controllers/sellers_controller.rb

  def create
    @s=Seller.create(seller_params)
---
INSERT INTO `sellers` (`name`, `created_at`, `updated_at`, `user_id`) VALUES ('OUZOM', '2016-08-29 16:58:26', '2016-08-29 16:58:26', 1)

  def set_seller
    @seller = Seller.find(params[:id])
---
SELECT  `sellers`.* FROM `sellers` WHERE `sellers`.`id` = 1 LIMIT 1