app/controllers/static_pages_controller.rb

  def home
    p "Home1"
    p params

      p "SIn filtro"
      @masvendidos = []
      @destacados = Product.sponsored.joins(:articles).take(18)
      @ultimos = Product.joins(:articles).group('id').order(created_at: :desc).take(18)
      listavendidos = Article.joins(:sells).group(:product_id).order('count_all desc').count.take(18)
---
SELECT  `products`.* FROM `products` INNER JOIN `articles` ON `articles`.`product_id` = `products`.`id` ORDER BY `products`.`created_at` DESC LIMIT 18
SELECT COUNT(*) AS count_all, `articles`.`product_id` AS articles_product_id FROM `articles` INNER JOIN `sells` ON `sells`.`article_id` = `articles`.`id` GROUP BY `articles`.`product_id` ORDER BY count_all desc