app/controllers/tiendas_controller.rb

SELECT  `sellers`.* FROM `sellers` WHERE `sellers`.`user_id` = 1 ORDER BY `sellers`.`id` ASC LIMIT 1
SELECT  `sellers`.* FROM `sellers` WHERE `sellers`.`id` = 1 LIMIT 1
SELECT `tiendas`.* FROM `tiendas` WHERE `tiendas`.`seller_id` = 1
---
  def index
    if user_signed_in? and current_user.isSeller?

        vendedor = Seller.where(user_id: current_user.id).first
        tienda_ids = Permiso.where(user_id: current_user.id).pluck(:tienda_id)
        @tiendas_secundarias =  Tienda.where(id: tienda_ids)
        if vendedor.blank?
          @tiendas = nil
        else
          @tiendas = Tienda.where(seller_id: vendedor.id)

SELECT  `tiendas`.* FROM `tiendas` WHERE `tiendas`.`id` = 1 LIMIT 1
---
  def show
    @tienda = Tienda.find(params[:id])

SELECT  `sellers`.* FROM `sellers` WHERE `sellers`.`user_id` = 1 ORDER BY `sellers`.`id` ASC LIMIT 1
---
  def new
    @vendedor = Seller.where(user_id: current_user.id).first

INSERT INTO `tiendas` (`name`, `seller_id`, `created_at`, `updated_at`) VALUES ('OUZOM', 1, '2016-08-29 16:59:01', '2016-08-29 16:59:01')
---
  def create
    p tienda_params
    tienda = Tienda.new(tienda_params)

    if tienda.save