app/views/categories/_form.html.erb

      <br/>
      Sub Nivel <%= f.select :category_id, Category.where(:category_id => 11).collect {|p| [ p.name, p.id ] },{:include_blank => 'SIN PADRE'} %>
---
SELECT `categories`.* FROM `categories` WHERE (category_id is null)