app/views/categories/index.html.erb

      </tr>
        <% category.subcategories.order(:name).each do |hijo| %>
---
SELECT `categories`.* FROM `categories` ORDER BY `categories`.`name` ASC
SELECT `subcategories`.* FROM `subcategories` WHERE `subcategories`.`category_id` = 1 ORDER BY `subcategories`.`name` ASC