app/views/products/_form.html.erb

  <%= f.text_field :name, :label => "NOMBRE" %>
  <%= f.select :marca_id,  Marca.all.collect {|p| [ p.name, p.id ] }, :label => "MARCA"  %>
  <%= f.select :category_id,  Category.optionsForSelect, :label => "CATEGORIA" %>
  <%= f.select :subcategory_id,  Subcategory.all.collect {|p| [ p.name, p.id ] }, :label => "SUBCATEGORIA" %>
---
SELECT `marcas`.* FROM `marcas`
SELECT `subcategories`.* FROM `subcategories`