app/views/products/index.html.erb

SELECT `products`.* FROM `products`
---

    <% Product.all.each do |product| %>