app/views/layouts/_categorias.html.erb

SELECT `categories`.* FROM `categories` WHERE (category_id is null) ORDER BY `categories`.`name` ASC
---

  <% Category.where("category_id is null").order(:name).each do |category| %>

SELECT `subcategories`.* FROM `subcategories` WHERE `subcategories`.`category_id` = 1 ORDER BY `subcategories`.`name` ASC
---
        <%= link_to "TODOS", homecategories_path(category.id), class: "btn btn-default btn-block"%>
         <% category.subcategories.order(:name).each do |hijo| %>