app/views/layouts/_tiendasmenu.html.erb

<% if current_user.present? && current_user.isSeller?  %>
---
SELECT  `sellers`.* FROM `sellers` WHERE `sellers`.`user_id` = 1 LIMIT 1

      </tr>
      <% current_user.seller.tiendas.each do |tienda| %>
---
SELECT `tiendas`.* FROM `tiendas` WHERE `tiendas`.`seller_id` = 1